#include <bits/stdc++.h>
using namespace std;
int main()
{
	freopen("interval.in", "r", stdin);
	freopen("interval.out", "w", stdout);
	cout<<"会但不多QwQ";
	return 0;
}
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
//不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目 不是这啥题目
